In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("../data/gapminder.tsv", sep="\t")

In [4]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [5]:
country_df = df['country']

In [9]:
print(type(country_df))
print(country_df.head())
print(country_df.tail())

<class 'pandas.core.series.Series'>
0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object
1699    Zimbabwe
1700    Zimbabwe
1701    Zimbabwe
1702    Zimbabwe
1703    Zimbabwe
Name: country, dtype: object

In [14]:
c_c_df = df[['country','continent','year']]

In [15]:
print(c_c_df)

          country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
1699     Zimbabwe    Africa  1987
1700     Zimbabwe    Africa  1992
1701     Zimbabwe    Africa  1997
1702     Zimbabwe    Africa  2002
1703     Zimbabwe    Africa  2007

[1704 rows x 3 columns]

In [16]:
c_t_df = df[['continent','pop']]

In [17]:
print(c_t_df)

     continent       pop
0         Asia   8425333
1         Asia   9240934
2         Asia  10267083
3         Asia  11537966
4         Asia  13079460
...        ...       ...
1699    Africa   9216418
1700    Africa  10704340
1701    Africa  11404948
1702    Africa  11926563
1703    Africa  12311143

[1704 rows x 2 columns]

In [19]:
c_df = df[['country']]

In [20]:
print(c_df)

          country
0     Afghanistan
1     Afghanistan
2     Afghanistan
3     Afghanistan
4     Afghanistan
...           ...
1699     Zimbabwe
1700     Zimbabwe
1701     Zimbabwe
1702     Zimbabwe
1703     Zimbabwe

[1704 rows x 1 columns]

In [21]:
print(df.loc[99])

country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap    721.186086
Name: 99, dtype: object

In [22]:
df.loc[1703]

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [24]:
s_df = pd.DataFrame({

    'c1' : [1,2,3],
    'c2' : [4,5,6],
    'c3' : [7,8,9]
})

In [25]:
s_df.index = ['i1','i2','i3']
s_df

    c1  c2  c3
i1   1   4   7
i2   2   5   8
i3   3   6   9

In [26]:
s_df.loc['i1']

c1    1
c2    4
c3    7
Name: i1, dtype: int64

In [31]:
subset1 = df.loc[1:100,['year','pop']]

In [32]:
print(subset1)

     year       pop
1    1957   9240934
2    1962  10267083
3    1967  11537966
4    1972  13079460
5    1977  14880372
..    ...       ...
96   1952  46886859
97   1957  51365468
98   1962  56839289
99   1967  62821884
100  1972  70759295

[100 rows x 2 columns]

In [33]:
subset2 = df.iloc[:,[2,4,-1]]

In [34]:
print(subset2)

      year       pop   gdpPercap
0     1952   8425333  779.445314
1     1957   9240934  820.853030
2     1962  10267083  853.100710
3     1967  11537966  836.197138
4     1972  13079460  739.981106
...    ...       ...         ...
1699  1987   9216418  706.157306
1700  1992  10704340  693.420786
1701  1997  11404948  792.449960
1702  2002  11926563  672.038623
1703  2007  12311143  469.709298

[1704 rows x 3 columns]

In [36]:
df.loc[[1,2],['year','lifeExp']]

   year  lifeExp
1  1957   30.332
2  1962   31.997

In [37]:
#인덱스 라벨 1,2,3에 대해서 컬럼은 continent,year,pop
df.loc[[1,2,3],['continent','year','pop']]

  continent  year       pop
1      Asia  1957   9240934
2      Asia  1962  10267083
3      Asia  1967  11537966

In [42]:
df.iloc[[100,200,300],[0,1,2,3]]

          country continent  year  lifeExp
100    Bangladesh      Asia  1972   45.252
200  Burkina Faso    Africa  1992   50.260
300      Colombia  Americas  1952   50.643